namespace DomainModel
{
    /// <summary>
    /// Икапсулирует регулярные выражения, используемые системой
    /// </summary>
    public static class RegularExpressions
    {
        /// <summary>
        /// Регулярное выражение для проверки номера телефона (поддерживается международный формат номера)
        /// </summary>
        public const string Phone = @"^\+(9[976]\d|8[987530]\d|6[987]\d|5[90]\d|42\d|3[875]\d|2[98654321]\d|9[8543210]|8[6421]|6[6543210]|5[87654321]|4[987654310]|3[9643210]|2[70]|7|1)\d{1,14}$";
        /// <summary>
        /// Регулярное выражение для проверки email
        /// </summary>
        public const string Email = @"^\b[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\.[A-Za-z]{2,4}\b$";
        /// <summary>
        /// Регулярное выражение для проверки шестнадцетиричного числа
        /// </summary>
        public const string Hex = "^([A-Fa-f0-9]{2})+$";
        /// <summary>
        /// Регулярное выражение для проверки пароля
        /// </summary>
        public const string Password = @"(?=^.{6,}$)(?=.*\d)(?=.*[a-z])(?=.*[A-Z])(?=.*[!@#$%^&amp;*()_+}{&quot;:;'?/&gt;.&lt;,])(?!.*\s).*$";
    }
}
